{
  "class_name": "Sequential",
  "config": {
    "name": "sequential_8",
    "layers": [
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_16",
          "trainable": true,
          "batch_input_shape": [
            null,
            28,
            28,
            1
          ],
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            2,
            2
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotNormal",
            "config": {
              "seed": 12
            }
          },
          "bias_initializer": {
            "class_name": "RandomNormal",
            "config": {
              "mean": 0.0,
              "stddev": 0.01,
              "seed": null
            }
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.009999999776482582,
              "l2": 0.0
            }
          },
          "bias_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "activity_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-06
            }
          },
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_16",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            1,
            1
          ],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_17",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "RandomNormal",
            "config": {
              "mean": 0.0,
              "stddev": 0.05,
              "seed": 12
            }
          },
          "bias_initializer": {
            "class_name": "RandomUniform",
            "config": {
              "minval": -0.05,
              "maxval": 0.05,
              "seed": 12
            }
          },
          "kernel_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.0,
              "l2": 9.999999747378752e-05
            }
          },
          "bias_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.009999999776482582,
              "l2": 0.0
            }
          },
          "activity_regularizer": {
            "class_name": "L1L2",
            "config": {
              "l1": 0.009999999776482582,
              "l2": 0.0
            }
          },
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_17",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Flatten",
        "config": {
          "name": "flatten_8",
          "trainable": true,
          "dtype": "float32",
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_20",
          "trainable": true,
          "dtype": "float32",
          "units": 256,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "RandomUniform",
            "config": {
              "minval": -0.05,
              "maxval": 0.05,
              "seed": 12
            }
          },
          "bias_initializer": {
            "class_name": "TruncatedNormal",
            "config": {
              "mean": 0.0,
              "stddev": 0.05,
              "seed": 12
            }
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": {
            "class_name": "MaxNorm",
            "config": {
              "max_value": 2.0,
              "axis": 0
            }
          },
          "bias_constraint": {
            "class_name": "MaxNorm",
            "config": {
              "max_value": 2.0,
              "axis": 0
            }
          }
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_21",
          "trainable": true,
          "dtype": "float32",
          "units": 84,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "TruncatedNormal",
            "config": {
              "mean": 0.0,
              "stddev": 0.05,
              "seed": 12
            }
          },
          "bias_initializer": {
            "class_name": "Constant",
            "config": {
              "value": 42
            }
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_22",
          "trainable": true,
          "dtype": "float32",
          "units": 10,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "Constant",
            "config": {
              "value": 0
            }
          },
          "bias_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_in",
              "distribution": "truncated_normal",
              "seed": null
            }
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      }
    ]
  },
  "keras_version": "2.2.4-tf",
  "backend": "tensorflow"
}