{
  "class_name": "Sequential",
  "config": {
    "name": "sequential_8",
    "layers": [
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_14",
          "trainable": true,
          "batch_input_shape": [
            null,
            28,
            28,
            1
          ],
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotNormal",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "GlorotNormal",
            "config": {
              "seed": null
            }
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_14",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_15",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotNormal",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "GlorotNormal",
            "config": {
              "seed": null
            }
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_15",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Flatten",
        "config": {
          "name": "flatten_7",
          "trainable": true,
          "dtype": "float32",
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_21",
          "trainable": true,
          "dtype": "float32",
          "units": 256,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotNormal",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "GlorotNormal",
            "config": {
              "seed": null
            }
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_22",
          "trainable": true,
          "dtype": "float32",
          "units": 84,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotNormal",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "GlorotNormal",
            "config": {
              "seed": null
            }
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_23",
          "trainable": true,
          "dtype": "float32",
          "units": 10,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotNormal",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "GlorotNormal",
            "config": {
              "seed": null
            }
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      }
    ]
  },
  "keras_version": "2.2.4-tf",
  "backend": "tensorflow"
}