{
  "class_name": "Sequential",
  "config": {
    "name": "sequential_12",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            32,
            32
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_16"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "GlorotUniform",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "GlorotNormal",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotNormal",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "HeNormal",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "HeNormal",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "HeUniform",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "HeUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "LeCunNormal",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "LecunNormal",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "LeCunUniform",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "LecunUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "Zeros",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "Constant",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "Constant",
            "config": {
              "value": 2
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "Ones",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "RandomNormal",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "RandomNormal",
            "config": {
              "mean": 0.0,
              "stddev": 1.0,
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "RandomUniform",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "RandomUniform",
            "config": {
              "minval": -0.05,
              "maxval": 0.05,
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "TruncatedNormal",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "TruncatedNormal",
            "config": {
              "mean": 0.0,
              "stddev": 0.05,
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "Identity",
          "trainable": true,
          "dtype": "float32",
          "units": 32,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "Identity",
            "config": {
              "gain": 3.4
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      }
    ]
  },
  "keras_version": "2.4.0",
  "backend": "tensorflow"
}