{
  "class_name": "Model",
  "config": {
    "name": "densenet121",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            224,
            224,
            3
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_1"
        },
        "name": "input_1",
        "inbound_nodes": []
      },
      {
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [
              3,
              3
            ],
            [
              3,
              3
            ]
          ],
          "data_format": "channels_last"
        },
        "name": "zero_padding2d",
        "inbound_nodes": [
          [
            [
              "input_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv1_conv",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            7,
            7
          ],
          "strides": [
            2,
            2
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv1_conv",
        "inbound_nodes": [
          [
            [
              "zero_padding2d",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "conv1_bn",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 1.001e-05,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "conv1_bn",
        "inbound_nodes": [
          [
            [
              "conv1_conv",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "conv1_relu",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "conv1_relu",
        "inbound_nodes": [
          [
            [
              "conv1_bn",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d_1",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [
              1,
              1
            ],
            [
              1,
              1
            ]
          ],
          "data_format": "channels_last"
        },
        "name": "zero_padding2d_1",
        "inbound_nodes": [
          [
            [
              "conv1_relu",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "pool1",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            3,
            3
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        },
        "name": "pool1",
        "inbound_nodes": [
          [
            [
              "zero_padding2d_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "conv2_block1_0_bn",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 1.001e-05,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "conv2_block1_0_bn",
        "inbound_nodes": [
          [
            [
              "pool1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "conv2_block1_0_relu",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "conv2_block1_0_relu",
        "inbound_nodes": [
          [
            [
              "conv2_block1_0_bn",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2_block1_1_conv",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2_block1_1_conv",
        "inbound_nodes": [
          [
            [
              "conv2_block1_0_relu",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "conv2_block1_1_bn",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 1.001e-05,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "conv2_block1_1_bn",
        "inbound_nodes": [
          [
            [
              "conv2_block1_1_conv",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "conv2_block1_1_relu",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "conv2_block1_1_relu",
        "inbound_nodes": [
          [
            [
              "conv2_block1_1_bn",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2_block1_2_conv",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2_block1_2_conv",
        "inbound_nodes": [
          [
            [
              "conv2_block1_1_relu",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Concatenate",
        "config": {
          "name": "conv2_block1_concat",
          "trainable": true,
          "dtype": "float32",
          "axis": 3
        },
        "name": "conv2_block1_concat",
        "inbound_nodes": [
          [
            [
              "pool1",
              0,
              0,
              {}
            ],
            [
              "conv2_block1_2_conv",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "conv2_block2_0_bn",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 1.001e-05,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "conv2_block2_0_bn",
        "inbound_nodes": [
          [
            [
              "conv2_block1_concat",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "conv2_block2_0_relu",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "conv2_block2_0_relu",
        "inbound_nodes": [
          [
            [
              "conv2_block2_0_bn",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2_block2_1_conv",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2_block2_1_conv",
        "inbound_nodes": [
          [
            [
              "conv2_block2_0_relu",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "conv2_block2_1_bn",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 1.001e-05,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "conv2_block2_1_bn",
        "inbound_nodes": [
          [
            [
              "conv2_block2_1_conv",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "conv2_block2_1_relu",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "conv2_block2_1_relu",
        "inbound_nodes": [
          [
            [
              "conv2_block2_1_bn",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2_block2_2_conv",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2_block2_2_conv",
        "inbound_nodes": [
          [
            [
              "conv2_block2_1_relu",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Concatenate",
        "config": {
          "name": "conv2_block2_concat",
          "trainable": true,
          "dtype": "float32",
          "axis": 3
        },
        "name": "conv2_block2_concat",
        "inbound_nodes": [
          [
            [
              "conv2_block1_concat",
              0,
              0,
              {}
            ],
            [
              "conv2_block2_2_conv",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "conv2_block3_0_bn",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 1.001e-05,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "conv2_block3_0_bn",
        "inbound_nodes": [
          [
            [
              "conv2_block2_concat",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "conv2_block3_0_relu",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "conv2_block3_0_relu",
        "inbound_nodes": [
          [
            [
              "conv2_block3_0_bn",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2_block3_1_conv",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2_block3_1_conv",
        "inbound_nodes": [
          [
            [
              "conv2_block3_0_relu",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "conv2_block3_1_bn",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 1.001e-05,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "conv2_block3_1_bn",
        "inbound_nodes": [
          [
            [
              "conv2_block3_1_conv",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "conv2_block3_1_relu",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "conv2_block3_1_relu",
        "inbound_nodes": [
          [
            [
              "conv2_block3_1_bn",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2_block3_2_conv",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2_block3_2_conv",
        "inbound_nodes": [
          [
            [
              "conv2_block3_1_relu",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Concatenate",
        "config": {
          "name": "conv2_block3_concat",
          "trainable": true,
          "dtype": "float32",
          "axis": 3
        },
        "name": "conv2_block3_concat",
        "inbound_nodes": [
          [
            [
              "conv2_block2_concat",
              0,
              0,
              {}
            ],
            [
              "conv2_block3_2_conv",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "conv2_block4_0_bn",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 1.001e-05,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "conv2_block4_0_bn",
        "inbound_nodes": [
          [
            [
              "conv2_block3_concat",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "conv2_block4_0_relu",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "conv2_block4_0_relu",
        "inbound_nodes": [
          [
            [
              "conv2_block4_0_bn",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2_block4_1_conv",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2_block4_1_conv",
        "inbound_nodes": [
          [
            [
              "conv2_block4_0_relu",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "conv2_block4_1_bn",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 1.001e-05,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "conv2_block4_1_bn",
        "inbound_nodes": [
          [
            [
              "conv2_block4_1_conv",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "conv2_block4_1_relu",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "conv2_block4_1_relu",
        "inbound_nodes": [
          [
            [
              "conv2_block4_1_bn",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2_block4_2_conv",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2_block4_2_conv",
        "inbound_nodes": [
          [
            [
              "conv2_block4_1_relu",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Concatenate",
        "config": {
          "name": "conv2_block4_concat",
          "trainable": true,
          "dtype": "float32",
          "axis": 3
        },
        "name": "conv2_block4_concat",
        "inbound_nodes": [
          [
            [
              "conv2_block3_concat",
              0,
              0,
              {}
            ],
            [
              "conv2_block4_2_conv",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "conv2_block5_0_bn",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 1.001e-05,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "conv2_block5_0_bn",
        "inbound_nodes": [
          [
            [
              "conv2_block4_concat",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "conv2_block5_0_relu",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "conv2_block5_0_relu",
        "inbound_nodes": [
          [
            [
              "conv2_block5_0_bn",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2_block5_1_conv",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2_block5_1_conv",
        "inbound_nodes": [
          [
            [
              "conv2_block5_0_relu",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "conv2_block5_1_bn",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 1.001e-05,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "conv2_block5_1_bn",
        "inbound_nodes": [
          [
            [
              "conv2_block5_1_conv",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "conv2_block5_1_relu",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "conv2_block5_1_relu",
        "inbound_nodes": [
          [
            [
              "conv2_block5_1_bn",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2_block5_2_conv",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2_block5_2_conv",
        "inbound_nodes": [
          [
            [
              "conv2_block5_1_relu",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Concatenate",
        "config": {
          "name": "conv2_block5_concat",
          "trainable": true,
          "dtype": "float32",
          "axis": 3
        },
        "name": "conv2_block5_concat",
        "inbound_nodes": [
          [
            [
              "conv2_block4_concat",
              0,
              0,
              {}
            ],
            [
              "conv2_block5_2_conv",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "conv2_block6_0_bn",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 1.001e-05,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "conv2_block6_0_bn",
        "inbound_nodes": [
          [
            [
              "conv2_block5_concat",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "conv2_block6_0_relu",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "conv2_block6_0_relu",
        "inbound_nodes": [
          [
            [
              "conv2_block6_0_bn",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2_block6_1_conv",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2_block6_1_conv",
        "inbound_nodes": [
          [
            [
              "conv2_block6_0_relu",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "conv2_block6_1_bn",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 1.001e-05,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "conv2_block6_1_bn",
        "inbound_nodes": [
          [
            [
              "conv2_block6_1_conv",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "conv2_block6_1_relu",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "conv2_block6_1_relu",
        "inbound_nodes": [
          [
            [
              "conv2_block6_1_bn",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2_block6_2_conv",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2_block6_2_conv",
        "inbound_nodes": [
          [
            [
              "conv2_block6_1_relu",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Concatenate",
        "config": {
          "name": "conv2_block6_concat",
          "trainable": true,
          "dtype": "float32",
          "axis": 3
        },
        "name": "conv2_block6_concat",
        "inbound_nodes": [
          [
            [
              "conv2_block5_concat",
              0,
              0,
              {}
            ],
            [
              "conv2_block6_2_conv",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "pool2_bn",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 1.001e-05,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "pool2_bn",
        "inbound_nodes": [
          [
            [
              "conv2_block6_concat",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "pool2_relu",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "pool2_relu",
        "inbound_nodes": [
          [
            [
              "pool2_bn",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "pool2_conv",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "pool2_conv",
        "inbound_nodes": [
          [
            [
              "pool2_relu",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "AveragePooling2D",
        "config": {
          "name": "pool2_pool",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        },
        "name": "pool2_pool",
        "inbound_nodes": [
          [
            [
              "pool2_conv",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "conv3_block1_0_bn",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 1.001e-05,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "conv3_block1_0_bn",
        "inbound_nodes": [
          [
            [
              "pool2_pool",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "conv3_block1_0_relu",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "conv3_block1_0_relu",
        "inbound_nodes": [
          [
            [
              "conv3_block1_0_bn",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv3_block1_1_conv",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv3_block1_1_conv",
        "inbound_nodes": [
          [
            [
              "conv3_block1_0_relu",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "conv3_block1_1_bn",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 1.001e-05,
          "center": true,
          "scale": true,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "conv3_block1_1_bn",
        "inbound_nodes": [
          [
            [
              "conv3_block1_1_conv",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "conv3_block1_1_relu",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "conv3_block1_1_relu",
        "inbound_nodes": [
          [
            [
              "conv3_block1_1_bn",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv3_block1_2_conv",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
