{
  "class_name": "Model",
  "config": {
    "name": "inception_v3",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            299,
            299,
            3
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_4"
        },
        "name": "input_4",
        "inbound_nodes": []
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_4",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            2,
            2
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_4",
        "inbound_nodes": [
          [
            [
              "input_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_4",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": false,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_4",
        "inbound_nodes": [
          [
            [
              "conv2d_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "activation",
        "inbound_nodes": [
          [
            [
              "batch_normalization_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_5",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_5",
        "inbound_nodes": [
          [
            [
              "activation",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_5",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": false,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_5",
        "inbound_nodes": [
          [
            [
              "conv2d_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_1",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "activation_1",
        "inbound_nodes": [
          [
            [
              "batch_normalization_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_6",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_6",
        "inbound_nodes": [
          [
            [
              "activation_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_6",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": false,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_6",
        "inbound_nodes": [
          [
            [
              "conv2d_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_2",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "activation_2",
        "inbound_nodes": [
          [
            [
              "batch_normalization_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_3",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            3,
            3
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        },
        "name": "max_pooling2d_3",
        "inbound_nodes": [
          [
            [
              "activation_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_7",
          "trainable": true,
          "dtype": "float32",
          "filters": 80,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_7",
        "inbound_nodes": [
          [
            [
              "max_pooling2d_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_7",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": false,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_7",
        "inbound_nodes": [
          [
            [
              "conv2d_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_3",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "activation_3",
        "inbound_nodes": [
          [
            [
              "batch_normalization_7",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_8",
          "trainable": true,
          "dtype": "float32",
          "filters": 192,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_8",
        "inbound_nodes": [
          [
            [
              "activation_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_8",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": false,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_8",
        "inbound_nodes": [
          [
            [
              "conv2d_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_4",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "activation_4",
        "inbound_nodes": [
          [
            [
              "batch_normalization_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_4",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            3,
            3
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        },
        "name": "max_pooling2d_4",
        "inbound_nodes": [
          [
            [
              "activation_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_12",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_12",
        "inbound_nodes": [
          [
            [
              "max_pooling2d_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_12",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": false,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_12",
        "inbound_nodes": [
          [
            [
              "conv2d_12",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_8",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "activation_8",
        "inbound_nodes": [
          [
            [
              "batch_normalization_12",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_10",
          "trainable": true,
          "dtype": "float32",
          "filters": 48,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_10",
        "inbound_nodes": [
          [
            [
              "max_pooling2d_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_13",
          "trainable": true,
          "dtype": "float32",
          "filters": 96,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_13",
        "inbound_nodes": [
          [
            [
              "activation_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_10",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": false,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_10",
        "inbound_nodes": [
          [
            [
              "conv2d_10",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_13",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": false,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_13",
        "inbound_nodes": [
          [
            [
              "conv2d_13",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_6",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "activation_6",
        "inbound_nodes": [
          [
            [
              "batch_normalization_10",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_9",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "activation_9",
        "inbound_nodes": [
          [
            [
              "batch_normalization_13",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "AveragePooling2D",
        "config": {
          "name": "average_pooling2d",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            3,
            3
          ],
          "padding": "same",
          "strides": [
            1,
            1
          ],
          "data_format": "channels_last"
        },
        "name": "average_pooling2d",
        "inbound_nodes": [
          [
            [
              "max_pooling2d_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_9",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_9",
        "inbound_nodes": [
          [
            [
              "max_pooling2d_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_11",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            5,
            5
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_11",
        "inbound_nodes": [
          [
            [
              "activation_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_14",
          "trainable": true,
          "dtype": "float32",
          "filters": 96,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_14",
        "inbound_nodes": [
          [
            [
              "activation_9",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_15",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_15",
        "inbound_nodes": [
          [
            [
              "average_pooling2d",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_9",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": false,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_9",
        "inbound_nodes": [
          [
            [
              "conv2d_9",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_11",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": false,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_11",
        "inbound_nodes": [
          [
            [
              "conv2d_11",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_14",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": false,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_14",
        "inbound_nodes": [
          [
            [
              "conv2d_14",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_15",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": false,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_15",
        "inbound_nodes": [
          [
            [
              "conv2d_15",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_5",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "activation_5",
        "inbound_nodes": [
          [
            [
              "batch_normalization_9",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_7",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "activation_7",
        "inbound_nodes": [
          [
            [
              "batch_normalization_11",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_10",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "activation_10",
        "inbound_nodes": [
          [
            [
              "batch_normalization_14",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_11",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "activation_11",
        "inbound_nodes": [
          [
            [
              "batch_normalization_15",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Concatenate",
        "config": {
          "name": "mixed0",
          "trainable": true,
          "dtype": "float32",
          "axis": 3
        },
        "name": "mixed0",
        "inbound_nodes": [
          [
            [
              "activation_5",
              0,
              0,
              {}
            ],
            [
              "activation_7",
              0,
              0,
              {}
            ],
            [
              "activation_10",
              0,
              0,
              {}
            ],
            [
              "activation_11",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_19",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_19",
        "inbound_nodes": [
          [
            [
              "mixed0",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_19",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": false,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_19",
        "inbound_nodes": [
          [
            [
              "conv2d_19",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_15",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "activation_15",
        "inbound_nodes": [
          [
            [
              "batch_normalization_19",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_17",
          "trainable": true,
          "dtype": "float32",
          "filters": 48,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_17",
        "inbound_nodes": [
          [
            [
              "mixed0",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_20",
          "trainable": true,
          "dtype": "float32",
          "filters": 96,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_20",
        "inbound_nodes": [
          [
            [
              "activation_15",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_17",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": false,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_17",
        "inbound_nodes": [
          [
            [
              "conv2d_17",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_20",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": false,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "batch_normalization_20",
        "inbound_nodes": [
          [
            [
              "conv2d_20",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_13",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "activation_13",
        "inbound_nodes": [
          [
            [
              "batch_normalization_17",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Activation",
        "config": {
          "name": "activation_16",
          "trainable": true,
          "dtype": "float32",
          "activation": "relu"
        },
        "name": "activation_16",
        "inbound_nodes": [
          [
            [
              "batch_normalization_20",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "AveragePooling2D",
        "config": {
          "name": "average_pooling2d_1",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            3,
            3
          ],
          "padding": "same",
          "strides": [
            1,
            1
          ],
          "data_format": "channels_last"
        },
        "name": "average_pooling2d_1",
        "inbound_nodes": [
          [
            [
              "mixed0",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_16",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_16",
        "inbound_nodes": [
          [
            [
              "mixed0",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_18",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            5,
            5
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_18",
        "inbound_nodes": [
          [
            [
              "activation_13",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_21",
          "trainable": true,
          "dtype": "float32",
          "filters": 96,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_21",
        "inbound_nodes": [
          [
            [
              "activation_16",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_22",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_22",
        "inbound_nodes": [
          [
            [
              "average_pooling2d_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "batch_normalization_16",
          "trainable": true,
          "dtype": "float32",
          "axis": [
            3
          ],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": false,
          "beta_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "gamma_initializer": {
            "class_name": "Ones",
            "config": {}
          },
          "moving_mean_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "moving_variance_initializer": {
            "class_name": "Ones",
