{
  "class_name": "Model",
  "config": {
    "name": "toy_resnet",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            28,
            28,
            1
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "img"
        },
        "name": "img",
        "inbound_nodes": []
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_34",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_34",
        "inbound_nodes": [
          [
            [
              "img",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_35",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_35",
        "inbound_nodes": [
          [
            [
              "conv2d_34",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_5",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            3,
            3
          ],
          "padding": "valid",
          "strides": [
            3,
            3
          ],
          "data_format": "channels_last"
        },
        "name": "max_pooling2d_5",
        "inbound_nodes": [
          [
            [
              "conv2d_35",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_36",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_36",
        "inbound_nodes": [
          [
            [
              "max_pooling2d_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_37",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_37",
        "inbound_nodes": [
          [
            [
              "conv2d_36",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Add",
        "config": {
          "name": "add_8",
          "trainable": true,
          "dtype": "float32"
        },
        "name": "add_8",
        "inbound_nodes": [
          [
            [
              "conv2d_37",
              0,
              0,
              {}
            ],
            [
              "max_pooling2d_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_38",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_38",
        "inbound_nodes": [
          [
            [
              "add_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_39",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_39",
        "inbound_nodes": [
          [
            [
              "conv2d_38",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Add",
        "config": {
          "name": "add_9",
          "trainable": true,
          "dtype": "float32"
        },
        "name": "add_9",
        "inbound_nodes": [
          [
            [
              "conv2d_39",
              0,
              0,
              {}
            ],
            [
              "add_8",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_40",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv2d_40",
        "inbound_nodes": [
          [
            [
              "add_9",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "GlobalAveragePooling2D",
        "config": {
          "name": "global_average_pooling2d_3",
          "trainable": true,
          "dtype": "float32",
          "data_format": "channels_last"
        },
        "name": "global_average_pooling2d_3",
        "inbound_nodes": [
          [
            [
              "conv2d_40",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_6",
          "trainable": true,
          "dtype": "float32",
          "units": 256,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_6",
        "inbound_nodes": [
          [
            [
              "global_average_pooling2d_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_7",
          "trainable": true,
          "dtype": "float32",
          "units": 10,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_7",
        "inbound_nodes": [
          [
            [
              "dense_6",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "img",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "dense_7",
        0,
        0
      ]
    ]
  },
  "keras_version": "2.2.4-tf",
  "backend": "tensorflow"
}
